import math


def area(r):
    '''
    Принимает радиус круга r и возвращает его площадь.

        Параметры:
            r (int/float): радиус круга

        Возвращаемое значение:
            math.pi * r ** 2 (float): площадь круга

        Пример вызова:
            res = area(5) # res = 78.53981633974483
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Принимает радиус круга r и возвращает длину его окружности.

        Параметры:
            r (int/float): радиус круга

        Возвращаемое значение:
            2 * math.pi * r (float): длина окружности

        Пример вызова:
            res = perimeter(5) # res = 31.41592653589793
    '''
    return 2 * math.pi * r

