def area(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его площадь.

        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника

        Возвращаемое значение:
            a * b (int/float): площадь прямоугольника

        Пример вызова:
            res = area(3, 5) # res = 15
    '''
    return a * b

def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его периметр.

        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника

        Возвращаемое значение:
            2 * (a + b) (int/float): периметр прямоугольника

        Пример вызова:
            res = perimeter(3, 5) # res = 16
    '''
    return (a + b) * 2