
def area(a):
    '''
    Принимает длину стороны квадрата a и возвращает его площадь.

        Параметры:
            a (int/float): сторона квадрата

        Возвращаемое значение:
            a ** 2 (int/float): площадь квадрата

        Пример вызова:
            res = area(4) # res = 16
    '''
    return a * a


def perimeter(a):
    '''
    Принимает длину стороны квадрата a и возвращает его периметр.

        Параметры:
            a (int/float): сторона квадрата

        Возвращаемое значение:
            4 * a (int/float): периметр квадрата

        Пример вызова:
            res = perimeter(4) # res = 16
    '''
    return 4 * a
