def area(a, h):
    '''
    Принимает сторону a и высоту h, опущенную на эту сторону, возвращает площадь треугольника.

        Параметры:
            a (int/float): сторона треугольника
            h (int/float): высота, опущенная на сторону a

        Возвращаемое значение:
            a * h / 2 (float): площадь треугольника

        Пример вызова:
            res = area(4, 5) # res = 10.0
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Принимает длины трех сторон треугольника a, b, c и возвращает его периметр.

        Параметры:
            a (int/float): первая сторона треугольника
            b (int/float): вторая сторона треугольника
            c (int/float): третья сторона треугольника

        Возвращаемое значение:
            a + b + c (int/float): периметр треугольника

        Пример вызова:
            res = perimeter(3, 4, 5) # res = 12
    '''
    return a + b + c